schedule = {
"Понедельник": [
        {"время": "08:00 - 09:50", "предмет": "NET-программирование", "преподаватель": "Бадалова М.А."},
        {"время": "09:00 - 09:50", "предмет": "Основы. Теория Дизайна", "преподаватель": "Саидова М.С."},
        {"время": "10:00 - 10:50", "подгруппа_1": {"предмет": "NET-программирование", "преподаватель": "Бадалова М.А."}},
        {"время": "10:00 - 10:50", "подгруппа_2": {"предмет": "Базы Данных", "преподаватель": "Кобилов Ш.С."}},
        {"время": "11:00 - 11:50", "предмет": "Основы. Теория Дизайна", "преподаватель": "Саидова М.С."},
        {"время": "12:00 - 12:50", "предмет": "NET-программирование", "преподаватель": "Бадалова М.А."},
    ],
    "Вторник": [
        {"время": "08:00 - 09:50", "предмет": "Базы Данных", "преподаватель": "Кобилов Ш.С."},
        {"время": "09:00 - 09:50", "предмет": "БЖД", "преподаватель": "Зоиров Ф.Б."},
        {"время": "10:00 - 10:50", "подгруппа_1": {"предмет": "БЖД", "преподаватель": "Зоиров Ф.Б."}},
        {"время": "10:00 - 10:50", "подгруппа_2": {"предмет": "Графические системы и мультимедиа", "преподаватель": "Хасанов Ч."}},
        {"время": "11:00 - 11:50", "подгруппа_1": {"предмет": "БЖД", "преподаватель": "Зоиров Ф.Б."}},
        {"время": "11:00 - 11:50", "подгруппа_2": {"предмет": "Графические системы и мультимедиа", "преподаватель": "Хасанов Ч."}},
        {"время": "12:00 - 12:50", "подгруппа_1": {"предмет": "WEB-программирование", "преподаватель": "Зоиров Ф.Б."}},
        {"время": "12:00 - 12:50", "подгруппа_2": {"предмет": "Базы Данных", "преподаватель": "Кобилов Ш.С."}},
    ],
    "Среда": [
        {"время": "08:00 - 09:50", "предмет": "Самостоятельная работа", "преподаватель": "Нет"},
        {"время": "09:00 - 09:50", "предмет": "Самостоятельная работа", "преподаватель": "Нет"},
        {"время": "10:00 - 10:50", "предмет": "Самостоятельная работа", "преподаватель": "Нет"},
    ],
    "Четверг": [
        {"предмет": "Военная кафедра", "преподаватель": "Нет"},
    ],
    "Пятница": [
        {"время": "08:00 - 09:50", "предмет": "WEB-программирование", "преподаватель": "Косимов А.А."},
        {"время": "09:00 - 09:50", "предмет": "Графические системы и мультимедиа", "преподаватель": "Хасанов Ч."},
        {"время": "10:00 - 10:50", "предмет": "Графические системы и мультимедиа", "преподаватель": "Хасанов Ч."},
        {"время": "11:00 - 11:50", "предмет": "WEB-программирование", "преподаватель": "Косимов А.А."},
        {"время": "12:00 - 12:50", "предмет": "Графические системы и мультимедиа", "преподаватель": "Хасанов Ч."},
    ],
    "Суббота": [
        {"время": "08:00 - 09:50", "предмет": "Проектирование-Администрирование сетевых Технологий", "преподаватель": "Каримов А.А."},
        {"время": "09:00 - 09:50", "предмет": "Проектирование-Администрирование сетевых Технологий", "преподаватель": "Каримов А.А."},
        {"время": "10:00 - 10:50", "предмет": "Проектирование-Администрирование сетевых Технологий", "преподаватель": "Каримов А.А."},
        {"время": "11:00 - 11:50", "предмет": "Проектирование-Администрирование сетевых Технологий", "преподаватель": "Каримов А.А."},
        {"время": "12:00 - 12:50", "предмет": "Android-разработка", "преподаватель": "Рачабзода К."},
        {"время": "13:00 - 13:50", "предмет": "Android-разработка", "преподаватель": "Рачабзода К."},
    ],
}
